# Statistics from Stock Data

구글, 애플, 아마존의 주식을 분석할 것입니다. 구글은 GOOG.csv 애플은 AAPL.csv 아마존은 AMZN.csv 파일에 주식 정보가 있습니다.

다음 7개의 컬럼이 있습니다

**Date Open High Low Close Adj_Close Volume**

csv 파일을 읽어서 DataFrame 으로 처리할 것입니다.

In [ ]:
# 상관관계 분석임

In [1]:
# 판다스를 임포트 하세요.
import pandas as pd 

# GOOG.csv 파일을 판다스로 읽어서 저장하세요.
df = pd.read_csv('GOOG.csv')


# 데이터의 처음 5줄을 화면에 출력하세요.
df.head(5)

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400



# To Do

우리는, 각 date 에 해당되는 adj close 값만 관심이 있습니다. 따라서 컬럼은 두개만 사용하며, 이 두개 컬럼의 인덱스는 date로 만듭니다. 

hints:

* Use the `index_col` keyword to indicate which column you want to use as an index. For example `index_col = ['Open']`

* Set the `parse_dates` keyword equal to `True` to convert the Dates into real dates of the form year/month/day

* Use the `usecols` keyword to select which columns you want to load into the DataFrame. For example `usecols = ['Open', 'High']`

Fill in the code below:

In [3]:
# We load the Google stock data into a DataFrame
google_stock = pd.read_csv('GOOG.csv', usecols=['Date', 'Adj Close'], index_col=['Date'])

In [4]:
google_stock

             Adj Close
Date
2004-08-19   49.845802
2004-08-20   53.805050
2004-08-23   54.346527
2004-08-24   52.096165
2004-08-25   52.657513
...                ...
2017-10-09  977.000000
2017-10-10  972.599976
2017-10-11  989.250000
2017-10-12  987.830017
2017-10-13  989.679993

[3313 rows x 1 columns]

In [15]:
google_stock.index

Index(['2004-08-19', '2004-08-20', '2004-08-23', '2004-08-24', '2004-08-25',
       '2004-08-26', '2004-08-27', '2004-08-30', '2004-08-31', '2004-09-01',
       ...
       '2017-10-02', '2017-10-03', '2017-10-04', '2017-10-05', '2017-10-06',
       '2017-10-09', '2017-10-10', '2017-10-11', '2017-10-12', '2017-10-13'],
      dtype='object', name='Date', length=3313)

In [6]:
google_stock = pd.read_csv('GOOG.csv', usecols=['Date', 'Adj Close'], index_col=['Date'], parse_dates=True)

In [8]:
google_stock

             Adj Close
Date
2004-08-19   49.845802
2004-08-20   53.805050
2004-08-23   54.346527
2004-08-24   52.096165
2004-08-25   52.657513
...                ...
2017-10-09  977.000000
2017-10-10  972.599976
2017-10-11  989.250000
2017-10-12  987.830017
2017-10-13  989.679993

[3313 rows x 1 columns]

In [7]:
 google_stock.index  #날짜형식가능

DatetimeIndex(['2004-08-19', '2004-08-20', '2004-08-23', '2004-08-24',
               '2004-08-25', '2004-08-26', '2004-08-27', '2004-08-30',
               '2004-08-31', '2004-09-01',
               ...
               '2017-10-02', '2017-10-03', '2017-10-04', '2017-10-05',
               '2017-10-06', '2017-10-09', '2017-10-10', '2017-10-11',
               '2017-10-12', '2017-10-13'],
              dtype='datetime64[ns]', name='Date', length=3313, freq=None)

In [28]:
# We load the Apple stock data into a DataFrame
apple_stock =   pd.read_csv('AAPL.csv', usecols=['Date', 'Adj Close'], index_col=['Date'], parse_dates=True)

In [29]:
# We load the Amazon stock data into a DataFrame
amazon_stock = pd.read_csv('AMZN.csv', usecols=['Date', 'Adj Close'], index_col=['Date'], parse_dates=True)

데이터 6개까지 출력해 봅니다.

In [24]:
apple_stock.head(2)

            Adj Close
Date
2000-01-03   3.596616
2000-01-04   3.293384

In [25]:
amazon_stock.head(2)

            Adj Close
Date
2000-01-03    89.3750
2000-01-04    81.9375

In [5]:
reviews.head(6)

                 Open       High        Low      Close  Adj Close    Volume
Date
2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400
2004-08-26  52.135906  53.626213  51.991844  53.606342  53.606342   7148200

`2000-01-01`  부터  `2016-12-31`년 까지의 데이터를 처리할것인데  `pd.date_range()` 함수를 이용해서 dates 변수를 만드세요. 그리고 나서 위의  dates 를 인덱스로 하여, 새로 all_stocks 란 데이터프레임을 만드세요

In [21]:
# We create calendar dates between '2000-01-01' and  '2016-12-31'
dates = pd.date_range('2000-01-01', '2018-12-31')

In [22]:
dates  # 검색하고싶으면 pandas date_range freq ??????????????????????????????????

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10',
               ...
               '2018-12-22', '2018-12-23', '2018-12-24', '2018-12-25',
               '2018-12-26', '2018-12-27', '2018-12-28', '2018-12-29',
               '2018-12-30', '2018-12-31'],
              dtype='datetime64[ns]', length=6940, freq='D')

In [23]:
# We create and empty DataFrame that uses the above dates as indices
all_stocks =   pd.DataFrame(index=dates)

In [30]:
all_stocks

Empty DataFrame
Columns: []
Index: [2000-01-01 00:00:00, 2000-01-02 00:00:00, 2000-01-03 00:00:00, 2000-01-04 00:00:00, 2000-01-05 00:00:00, 2000-01-06 00:00:00, 2000-01-07 00:00:00, 2000-01-08 00:00:00, 2000-01-09 00:00:00, 2000-01-10 00:00:00, 2000-01-11 00:00:00, 2000-01-12 00:00:00, 2000-01-13 00:00:00, 2000-01-14 00:00:00, 2000-01-15 00:00:00, 2000-01-16 00:00:00, 2000-01-17 00:00:00, 2000-01-18 00:00:00, 2000-01-19 00:00:00, 2000-01-20 00:00:00, 2000-01-21 00:00:00, 2000-01-22 00:00:00, 2000-01-23 00:00:00, 2000-01-24 00:00:00, 2000-01-25 00:00:00, 2000-01-26 00:00:00, 2000-01-27 00:00:00, 2000-01-28 00:00:00, 2000-01-29 00:00:00, 2000-01-30 00:00:00, 2000-01-31 00:00:00, 2000-02-01 00:00:00, 2000-02-02 00:00:00, 2000-02-03 00:00:00, 2000-02-04 00:00:00, 2000-02-05 00:00:00, 2000-02-06 00:00:00, 2000-02-07 00:00:00, 2000-02-08 00:00:00, 2000-02-09 00:00:00, 2000-02-10 00:00:00, 2000-02-11 00:00:00, 2000-02-12 00:00:00, 2000-02-13 00:00:00, 2000-02-14 00:00:00, 2000-02-15 00:00:00, 2000-02-16 00:00:00, 2000-02-17 00:00:00, 2000-02-18 00:00:00, 2000-02-19 00:00:00, 2000-02-20 00:00:00, 2000-02-21 00:00:00, 2000-02-22 00:00:00, 2000-02-23 00:00:00, 2000-02-24 00:00:00, 2000-02-25 00:00:00, 2000-02-26 00:00:00, 2000-02-27 00:00:00, 2000-02-28 00:00:00, 2000-02-29 00:00:00, 2000-03-01 00:00:00, 2000-03-02 00:00:00, 2000-03-03 00:00:00, 2000-03-04 00:00:00, 2000-03-05 00:00:00, 2000-03-06 00:00:00, 2000-03-07 00:00:00, 2000-03-08 00:00:00, 2000-03-09 00:00:00, 2000-03-10 00:00:00, 2000-03-11 00:00:00, 2000-03-12 00:00:00, 2000-03-13 00:00:00, 2000-03-14 00:00:00, 2000-03-15 00:00:00, 2000-03-16 00:00:00, 2000-03-17 00:00:00, 2000-03-18 00:00:00, 2000-03-19 00:00:00, 2000-03-20 00:00:00, 2000-03-21 00:00:00, 2000-03-22 00:00:00, 2000-03-23 00:00:00, 2000-03-24 00:00:00, 2000-03-25 00:00:00, 2000-03-26 00:00:00, 2000-03-27 00:00:00, 2000-03-28 00:00:00, 2000-03-29 00:00:00, 2000-03-30 00:00:00, 2000-03-31 00:00:00, 2000-04-01 00:00:00, 2000-04-02 00:00:00, 2000-04-03 00:00:00, 2000-04-04 00:00:00, 2000-04-05 00:00:00, 2000-04-06 00:00:00, 2000-04-07 00:00:00, 2000-04-08 00:00:00, 2000-04-09 00:00:00, ...]

[6940 rows x 0 columns]

In [24]:
google_stock.head(1)

            Adj Close
Date
2004-08-19  49.845802

In [30]:
apple_stock.head(1)

            Adj Close
Date
2000-01-03   3.596616

In [31]:
amazon_stock.head(1)

            Adj Close
Date
2000-01-03     89.375

# To Do

각 `google_stock`, `apple_stock`, `amazon_stock`, 을,  `all_stocks` 의 날짜에 매칭하여 수정종가를 나오게 하기 위해, all_stocks와 각각의 데이터프레임을 join 할 것입니다. 그러나 일단은 먼저, 현재의 구글,애플, 아마존의 DataFrame에 있는 컬럼명을, 각각의 수정종가로 표현하기 위해, 각각의 adj close 를 google_stock, apple_stock, amazon_stock 로 바꿔주세요.  `pd.DataFrame.rename()` 함수를 이용하세요.

In [32]:
# Change the Adj Close column label to Google
google_stock = google_stock.rename(columns={'Adj Close' : 'google_stock'})
# Change the Adj Close column label to Apple
apple_stock = apple_stock.rename(columns={'Adj Close' : 'apple_stock'})

# Change the Adj Close column label to Amazon
amazon_stock = amazon_stock.rename(columns={'Adj Close' : 'amazon_stock'})

In [33]:
apple_stock.head(1)

            apple_stock
Date
2000-01-03     3.596616

In [ ]:
all_stocks

In [35]:
# We display the google_stock DataFrame
all_stocks = all_stocks.join(google_stock)

In [36]:
all_stocks.head(2)

            google_stock
2000-01-01           NaN
2000-01-02           NaN

In [37]:
# We display the apple_stock DataFrame
all_stocks = all_stocks.join(apple_stock)

In [38]:
all_stocks

            google_stock  apple_stock
2000-01-01           NaN          NaN
2000-01-02           NaN          NaN
2000-01-03           NaN     3.596616
2000-01-04           NaN     3.293384
2000-01-05           NaN     3.341579
...                  ...          ...
2018-12-27           NaN          NaN
2018-12-28           NaN          NaN
2018-12-29           NaN          NaN
2018-12-30           NaN          NaN
2018-12-31           NaN          NaN

[6940 rows x 2 columns]

In [39]:
all_stocks.index[0].weekday() #0이 월

5

In [ ]:
# We displaay the amazon_stock DataFrame

In [40]:
all_stocks = all_stocks.join(amazon_stock)

In [41]:
all_stocks

            google_stock  apple_stock  amazon_stock
2000-01-01           NaN          NaN           NaN
2000-01-02           NaN          NaN           NaN
2000-01-03           NaN     3.596616       89.3750
2000-01-04           NaN     3.293384       81.9375
2000-01-05           NaN     3.341579       69.7500
...                  ...          ...           ...
2018-12-27           NaN          NaN           NaN
2018-12-28           NaN          NaN           NaN
2018-12-29           NaN          NaN           NaN
2018-12-30           NaN          NaN           NaN
2018-12-31           NaN          NaN           NaN

[6940 rows x 3 columns]

이제 `all_stocks` DataFrame 를 기준으로, 각각의 구글,애플,아마존의 데이터프레임을 합치겠습니다. `dataframe.join()` 함수를 이용하세요. T `dataframe1.join(dataframe2)`  `dataframe1` 을 기준으로 `dataframe2`를 합치는 함수입니다.

In [42]:
# We join the Google stock to all_stocks
all_stocks.isna().sum()  #구글 아마존 애플나와야

google_stock    3627
apple_stock     2465
amazon_stock    2465
dtype: int64

In [43]:
# We join the Apple stock to all_stocks
all_stocks =  all_stocks.dropna()

In [44]:
all_stocks

            google_stock  apple_stock  amazon_stock
2004-08-19     49.845802     1.973460     38.630001
2004-08-20     53.805050     1.979244     39.509998
2004-08-23     54.346527     1.997236     39.450001
2004-08-24     52.096165     2.053144     39.049999
2004-08-25     52.657513     2.123831     40.299999
...                  ...          ...           ...
2017-10-09    977.000000   155.839996    990.989990
2017-10-10    972.599976   155.899994    987.200012
2017-10-11    989.250000   156.550003    995.000000
2017-10-12    987.830017   156.000000   1000.929993
2017-10-13    989.679993   156.990005   1002.940002

[3313 rows x 3 columns]

In [45]:
all_stocks.isna().sum() # 0되야

google_stock    0
apple_stock     0
amazon_stock    0
dtype: int64

In [ ]:
# We join the Amazon stock to all_stocks
all_stocks =

 `all_stocks`  를 앞에서 10줄 출력하여 확인하세요.

# To Do

해당 년도의 데이터가 없는 경우도 있을것입니다. 즉, 데이터가 NaN 으로 나오면 해당년도 데이터가 없는것입니다. 그러므로 NaN이 포함되어 있는지 먼저 확인해 봅니다.

In [ ]:
# Check if there are any NaN values in the all_stocks dataframe

In [6]:
reviews.isna()

             Open   High    Low  Close  Adj Close  Volume
Date
2004-08-19  False  False  False  False      False   False
2004-08-20  False  False  False  False      False   False
2004-08-23  False  False  False  False      False   False
2004-08-24  False  False  False  False      False   False
2004-08-25  False  False  False  False      False   False
...           ...    ...    ...    ...        ...     ...
2017-10-09  False  False  False  False      False   False
2017-10-10  False  False  False  False      False   False
2017-10-11  False  False  False  False      False   False
2017-10-12  False  False  False  False      False   False
2017-10-13  False  False  False  False      False   False

[3313 rows x 6 columns]

이제 NaN 값을 포함하는 행은 제거합니다.

In [ ]:
# Remove any rows that contain NaN values
all_stocks =

 `all_stocks`  에 NaN 이 없어졌는지 체크해 보세요.

In [ ]:
# Check if there are any NaN values in the all_stocks dataframe

 `all_stocks`  를 화면에 출력하세요.

In [ ]:
# We display the all_stocks DataFrame

In [ ]:
  all_stocks  # 위에함

이제 아래의 통계데이터를 얻어봅시다. 아래를 각각 채워서 실행해 보세요.

In [46]:
# 각 스톡의 평균을 출력하세요
all_stocks.mean()

google_stock    380.072458
apple_stock      53.535194
amazon_stock    259.044320
dtype: float64

In [47]:
# 각 스톡의 표준편차를 출력하세요.
all_stocks.std()

google_stock    223.853780
apple_stock      43.068747
amazon_stock    256.779834
dtype: float64

In [ ]:
# 2010년 부터 2014년 까지의 주식의 평균과 표준편차
#2010~2014
#2010:2014

In [48]:
all_stocks

            google_stock  apple_stock  amazon_stock
2004-08-19     49.845802     1.973460     38.630001
2004-08-20     53.805050     1.979244     39.509998
2004-08-23     54.346527     1.997236     39.450001
2004-08-24     52.096165     2.053144     39.049999
2004-08-25     52.657513     2.123831     40.299999
...                  ...          ...           ...
2017-10-09    977.000000   155.839996    990.989990
2017-10-10    972.599976   155.899994    987.200012
2017-10-11    989.250000   156.550003    995.000000
2017-10-12    987.830017   156.000000   1000.929993
2017-10-13    989.679993   156.990005   1002.940002

[3313 rows x 3 columns]

In [49]:
all_stocks.loc[  '2010' :' 2014',  ]

            google_stock  apple_stock  amazon_stock
2010-01-04    311.349976    27.505054    133.899994
2010-01-05    309.978882    27.552608    134.690002
2010-01-06    302.164703    27.114347    132.250000
2010-01-07    295.130463    27.064222    130.000000
2010-01-08    299.064880    27.244156    133.520004
...                  ...          ...           ...
2014-12-24    525.878418   106.412552    303.029999
2014-12-26    531.109680   108.293594    309.089996
2014-12-29    527.429932   108.217598    312.040009
2014-12-30    527.519409   106.897041    310.299988
2014-12-31    523.521423   104.863991    310.350006

[1258 rows x 3 columns]

In [50]:
all_stocks.loc[  '2010' :' 2014',  ].mean()

google_stock    373.204694
apple_stock      60.667288
amazon_stock    237.366821
dtype: float64

In [51]:
all_stocks.loc[  '2010' :' 2014',  ].std()

google_stock    115.018544
apple_stock      20.658444
amazon_stock     75.329963
dtype: float64

In [52]:
all_stocks.loc[  '2010' :' 2014',  ].describe()

       google_stock  apple_stock  amazon_stock
count   1258.000000  1258.000000   1258.000000
mean     373.204694    60.667288    237.366821
std      115.018544    20.658444     75.329963
min      216.626053    24.682707    108.610001
25%      283.785500    43.933088    180.434998
50%      315.475631    59.052606    227.514999
75%      450.283836    74.568372    302.112503
max      606.142639   113.053238    407.049988

In [53]:
# 각 스톡의 correlation을 출력하세요. 
# 상관관계 컬럼과의, 그 컬럼들 이름으로 되어있어야한다, 상관계수 값이 범위별 의미 중요, 
#1비례 -1반비례 0 관계없음
all_stocks.corr() #결과 데이터 3개나와야됨

              google_stock  apple_stock  amazon_stock
google_stock      1.000000     0.929359      0.965853
apple_stock       0.929359     1.000000      0.915749
amazon_stock      0.965853     0.915749      1.000000

In [54]:
df_new.corr()

NameError: name 'df_new' is not defined